-- ----------------------------
-- 日期：2017-09-14 09:47:51
-- 仅用于测试和学习,本程序不适合处理超大量数据
-- ----------------------------

-- ----------------------------
-- Table structure for `allstudent`
-- ----------------------------
DROP TABLE IF EXISTS `allstudent`;
CREATE TABLE `allstudent` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `Xstu` int(11) NOT NULL COMMENT '学生序号',
  `stunum` bigint(12) NOT NULL COMMENT '学生学号',
  `stuname` varchar(255) NOT NULL COMMENT '学生姓名',
  `stugroup` varchar(10) DEFAULT NULL COMMENT '学生组号',
  `sex` varchar(22) NOT NULL COMMENT '性别',
  `classname` varchar(355) NOT NULL COMMENT '班级名字',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=135 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for `allworks`
-- ----------------------------
DROP TABLE IF EXISTS `allworks`;
CREATE TABLE `allworks` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Xstu` int(11) NOT NULL COMMENT '学生序号',
  `stunum` bigint(12) NOT NULL,
  `stuname` varchar(255) CHARACTER SET utf8 NOT NULL DEFAULT '',
  `Qian_gong` int(11) DEFAULT '-1' COMMENT '钳工',
  `Pu_xi` int(11) DEFAULT '-1' COMMENT '普通铣削',
  `Mo_xue` int(11) DEFAULT '-1' COMMENT '磨削',
  `Dian_huo_hua` int(11) DEFAULT '-1' COMMENT '电火花',
  `Chong_ya` int(11) DEFAULT '-1' COMMENT '冲压',
  `Zhu_zao` int(11) DEFAULT '-1' COMMENT '铸造',
  `Mu_ju` int(11) DEFAULT '-1' COMMENT '模具',
  `Han_jie` int(11) DEFAULT '-1' COMMENT '焊接',
  `Pu_che` int(11) DEFAULT '-1' COMMENT '普车',
  `Jia_gong` int(11) DEFAULT '-1',
  `Shu_chong` int(11) NOT NULL DEFAULT '-1',
  `Shu_xi` int(11) NOT NULL DEFAULT '-1',
  `Shu_che` int(11) NOT NULL DEFAULT '-1',
  `PLC` int(11) NOT NULL DEFAULT '-1',
  `Xian_qie_ge` int(11) NOT NULL DEFAULT '-1',
  `Kuai_su_cheng_xing` int(11) NOT NULL DEFAULT '-1',
  `re_chu_li` int(11) NOT NULL DEFAULT '-1',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=135 DEFAULT CHARSET=latin1;

-- ----------------------------
-- Table structure for `classss`
-- ----------------------------
DROP TABLE IF EXISTS `classss`;
CREATE TABLE `classss` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `classname` varchar(355) NOT NULL,
  `allS` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Table structure for `singlegrade`
-- ----------------------------
DROP TABLE IF EXISTS `singlegrade`;
CREATE TABLE `singlegrade` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Xstu` bigint(12) NOT NULL,
  `stunum` bigint(12) NOT NULL,
  `grade` int(11) NOT NULL DEFAULT '0',
  `txt` int(11) NOT NULL DEFAULT '0',
  `re_grade` int(11) NOT NULL DEFAULT '0',
  `work` varchar(100) CHARACTER SET utf8 NOT NULL COMMENT '标注工种',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=137 DEFAULT CHARSET=latin1 COMMENT='单工种成绩表';

-- ----------------------------
-- Table structure for `totalmark`
-- ----------------------------
DROP TABLE IF EXISTS `totalmark`;
CREATE TABLE `totalmark` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Xstu` int(11) NOT NULL DEFAULT '0' COMMENT '学生序号',
  `stunum` bigint(12) NOT NULL DEFAULT '0',
  `stuname` varchar(255) CHARACTER SET utf8 NOT NULL DEFAULT '',
  `regular_grade` int(11) DEFAULT '0',
  `exam_grade` int(11) DEFAULT '0',
  `written_grade` int(11) DEFAULT '0' COMMENT '实验成绩',
  `final_grade` int(11) DEFAULT '0',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=135 DEFAULT CHARSET=latin1 COMMENT='总评成绩';

-- ----------------------------
-- Records for `allstudent`
-- ----------------------------
INSERT INTO `allstudent` VALUES ('1', '1', '201330092001', '陈秋华', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('2', '2', '201330092015', '郝顺章', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('3', '3', '201330092018', '陈子琦', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('4', '4', '201330092020', '黄思准', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('5', '5', '201330092025', '陈旭鸿', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('6', '6', '201330092027', '陈成钧', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('7', '7', '201330092034', '林仁仕', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('8', '8', '201330092039', '陈平深', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('9', '9', '201330092043', '陈超鹏', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('10', '10', '201330092053', '欧艳芬', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('11', '11', '201330092054', '江家尧', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('12', '12', '201330092058', '余麟浩', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('13', '13', '201330092061', '林志鑫', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('14', '14', '201330092065', '何志伟', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('15', '15', '201330092073', '刘荣乐', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('16', '16', '201330092078', '郑文鑫', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('17', '17', '201330092080', '吴靖康', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('18', '18', '201330092084', '陈宝怡', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('19', '19', '201330092097', '胡伊敏', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('20', '20', '201330092098', '柯坚宇', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('21', '21', '201330092100', '林秀媛', 'A', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('22', '22', '201330092106', '何韵仪', 'A', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('23', '23', '201330092109', '赵彩虹', 'B', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('24', '24', '201330092110', '李惠玉', 'B', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('25', '25', '201330092113', '庞延玲', 'B', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('26', '26', '201330092114', '肖海媚', 'B', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('27', '27', '201330092118', '吴彩玲', 'B', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('28', '28', '201330092130', '陈志明', 'B', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('29', '29', '201330092135', '陈柏蓉', 'B', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('30', '30', '201330092136', '黄楚彬', 'B', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('31', '31', '201330092137', '彭金灿', 'B', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('32', '32', '201330092138', '林嘉怡', 'B', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('33', '33', '201330092145', '林东升', 'B', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('34', '34', '201330092147', '吴逸舒', 'B', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('35', '35', '201330092159', '张翎', 'B', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('36', '36', '201330092162', '雷俊贤', 'B', '女', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('37', '37', '201330092163', '汤诗文', 'B', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('38', '38', '201330092173', '黄俊', 'B', '男', '工商学院14级工商管理（1）班');
INSERT INTO `allstudent` VALUES ('39', '1', '201430090248', '苏英诗', 'B', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('40', '2', '201430090236', '钟胜', 'B', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('41', '3', '201430090234', '何昌原', 'B', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('42', '4', '201430090253', '程裕', 'B', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('43', '5', '201430090256', '冯嘉欣', 'B', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('44', '6', '201430090257', '张智律', 'B', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('45', '7', '201430090215', '何佩怡', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('46', '8', '201430090209', '赵爱醒', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('47', '9', '201430090193', '陈丽军', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('48', '10', '201430090183', '陈春玉', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('49', '11', '201430090179', '廖若红', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('50', '12', '201430090322', '李东铭', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('51', '13', '201430105049', '叶立中', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('52', '14', '201430093096', '彭鸿标', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('53', '15', '201430093082', '李启东', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('54', '16', '201430093068', '朱孝文', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('55', '17', '201430090296', '米纪刚', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('56', '18', '201430090321', '江其航', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('57', '19', '201430090318', '汪驰', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('58', '20', '201430090306', '庄石园', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('59', '21', '201430090299', '周颖', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('60', '22', '201430090298', '符天玉', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('61', '23', '201430090141', '姚子轩', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('62', '24', '201430090075', '叶建达', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('63', '25', '201430090101', '余贵玲', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('64', '26', '201430090100', '何敏', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('65', '27', '201430090097', '吴祺威', 'C', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('66', '28', '201430090091', '袁旭嘉', 'C', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('67', '29', '201430090112', '黄婧雯', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('68', '30', '201430090073', '李文东', 'D', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('69', '31', '201430090064', '陈勇', 'D', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('70', '32', '201430090058', '曹林青', 'D', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('71', '33', '201430090051', '钟超飞', 'D', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('72', '34', '201430090043', '刘赵红', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('73', '35', '201430090175', '胡婉仪', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('74', '36', '201430090113', '江静文', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('75', '37', '201430090119', '何福针', 'D', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('76', '38', '201430090127', '吴淑慧', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('77', '39', '201430090128', '饶亚倩', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('78', '40', '201430090130', '谭月嫦', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('79', '41', '201430090132', '温小仪', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('80', '42', '201430090135', '张康玉', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('81', '43', '201430090142', '马钟涛', 'D', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('82', '44', '201430090145', '肖颖', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('83', '45', '201430090173', '关晓琳', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('84', '46', '201430090025', '罗帼英', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('85', '47', '201430090012', '张炜能', 'D', '男', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('86', '48', '201430090010', '杨嘉欣', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('87', '49', '201430090021', '张文燕', 'D', '女', '工商学院14级工商管理（2）班');
INSERT INTO `allstudent` VALUES ('88', '1', '201430090195', '张秋杏', 'A', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('89', '2', '201430090223', '何宇静', 'C', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('90', '3', '201430090219', '吴柏棋', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('91', '4', '201430090216', '李斯琪', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('92', '5', '201430090211', '何嘉丽', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('93', '6', '201430090224', '蔡子荣', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('94', '7', '201430090187', '蔡莹莹', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('95', '8', '201430090182', '梁伟俭', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('96', '9', '201430090177', '刘紫珊', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('97', '10', '201430090174', '陈铭惠', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('98', '11', '201430090168', '周韵茜', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('99', '12', '201430090163', '张文俊', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('100', '13', '201430090272', '林广泉', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('101', '14', '201430090319', '潘爱真', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('102', '15', '201430090307', '陈海龙', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('103', '16', '201430090305', '吴伟华', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('104', '17', '201430090285', '陈晓洁', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('105', '18', '201430090229', '吕淑文', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('106', '19', '201430090269', '张宪浩', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('107', '20', '201430090264', '洪树鑫', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('108', '21', '201430090263', '杨钰莹', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('109', '22', '201430090240', '罗小玲', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('110', '23', '201430090237', '陈思宇', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('111', '24', '201430090320', '刘雯琪', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('112', '25', '201430090032', '金碧炫', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('113', '26', '201430090054', '黄秋敏', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('114', '27', '201430090042', '何景豪', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('115', '28', '201430090035', '谢冠豪', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('116', '29', '201430090034', '钟伟樑', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('117', '30', '201430090061', '钟俭成', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('118', '31', '201430090026', '莫小莹', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('119', '32', '201430090024', '刘炳晖', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('120', '33', '201430090022', '施建威', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('121', '34', '201430090004', '李子聪', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('122', '35', '201330114262', '叶芾林', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('123', '36', '201430090148', '颜晓苗', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('124', '37', '201430090124', '巫建松', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('125', '38', '201430090143', '黄少鹏', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('126', '39', '201430090134', '刘俊斌', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('127', '40', '201430090131', '文安琪', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('128', '41', '201430090126', '曾伶俐', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('129', '42', '201430090071', '余集堡', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('130', '43', '201430090116', '宋芷晴', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('131', '44', '201430090114', '朱巾娥', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('132', '45', '201430090105', '朱雯静', 'E', '女', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('133', '46', '201430090087', '梁毅俊', 'E', '男', '工商学院14级工商管理（3）班');
INSERT INTO `allstudent` VALUES ('134', '47', '201430090076', '钟苏婷', 'G', '女', '工商学院14级工商管理（3）班');

-- ----------------------------
-- Records for `allworks`
-- ----------------------------
INSERT INTO `allworks` VALUES ('1', '1', '201330092001', '陈秋华', '115', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('2', '2', '201330092015', '郝顺章', '117', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('3', '3', '201330092018', '陈子琦', '119', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('4', '4', '201330092020', '黄思准', '121', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('5', '5', '201330092025', '陈旭鸿', '123', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('6', '6', '201330092027', '陈成钧', '125', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('7', '7', '201330092034', '林仁仕', '127', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('8', '8', '201330092039', '陈平深', '129', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('9', '9', '201330092043', '陈超鹏', '131', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('10', '10', '201330092053', '欧艳芬', '133', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('11', '11', '201330092054', '江家尧', '135', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('12', '12', '201330092058', '余麟浩', '137', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('13', '13', '201330092061', '林志鑫', '139', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('14', '14', '201330092065', '何志伟', '141', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('15', '15', '201330092073', '刘荣乐', '143', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('16', '16', '201330092078', '郑文鑫', '93', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('17', '17', '201330092080', '吴靖康', '95', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('18', '18', '201330092084', '陈宝怡', '97', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('19', '19', '201330092097', '胡伊敏', '99', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('20', '20', '201330092098', '柯坚宇', '101', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('21', '21', '201330092100', '林秀媛', '103', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('22', '22', '201330092106', '何韵仪', '105', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('23', '23', '201330092109', '赵彩虹', '107', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('24', '24', '201330092110', '李惠玉', '109', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('25', '25', '201330092113', '庞延玲', '111', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('26', '26', '201330092114', '肖海媚', '113', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('27', '27', '201330092118', '吴彩玲', '115', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('28', '28', '201330092130', '陈志明', '117', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('29', '29', '201330092135', '陈柏蓉', '119', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('30', '30', '201330092136', '黄楚彬', '121', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('31', '31', '201330092137', '彭金灿', '123', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('32', '32', '201330092138', '林嘉怡', '125', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('33', '33', '201330092145', '林东升', '66', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('34', '34', '201330092147', '吴逸舒', '68', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('35', '35', '201330092159', '张翎', '70', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('36', '36', '201330092162', '雷俊贤', '72', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('37', '37', '201330092163', '汤诗文', '74', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('38', '38', '201330092173', '黄俊', '76', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('39', '1', '201430090248', '苏英诗', '52', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('40', '2', '201430090236', '钟胜', '54', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('41', '3', '201430090234', '何昌原', '56', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('42', '4', '201430090253', '程裕', '58', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('43', '5', '201430090256', '冯嘉欣', '60', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('44', '6', '201430090257', '张智律', '62', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('45', '7', '201430090215', '何佩怡', '64', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('46', '8', '201430090209', '赵爱醒', '66', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('47', '9', '201430090193', '陈丽军', '68', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('48', '10', '201430090183', '陈春玉', '70', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('49', '11', '201430090179', '廖若红', '72', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('50', '12', '201430090322', '李东铭', '74', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('51', '13', '201430105049', '叶立中', '76', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('52', '14', '201430093096', '彭鸿标', '78', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('53', '15', '201430093082', '李启东', '80', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('54', '16', '201430093068', '朱孝文', '67', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('55', '17', '201430090296', '米纪刚', '69', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('56', '18', '201430090321', '江其航', '71', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('57', '19', '201430090318', '汪驰', '73', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('58', '20', '201430090306', '庄石园', '75', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('59', '21', '201430090299', '周颖', '77', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('60', '22', '201430090298', '符天玉', '79', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('61', '23', '201430090141', '姚子轩', '81', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('62', '24', '201430090075', '叶建达', '83', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('63', '25', '201430090101', '余贵玲', '85', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('64', '26', '201430090100', '何敏', '87', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('65', '27', '201430090097', '吴祺威', '89', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('66', '28', '201430090091', '袁旭嘉', '91', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('67', '29', '201430090112', '黄婧雯', '93', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('68', '30', '201430090073', '李文东', '95', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('69', '31', '201430090064', '陈勇', '97', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('70', '32', '201430090058', '曹林青', '99', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('71', '33', '201430090051', '钟超飞', '3', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('72', '34', '201430090043', '刘赵红', '5', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('73', '35', '201430090175', '胡婉仪', '7', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('74', '36', '201430090113', '江静文', '9', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('75', '37', '201430090119', '何福针', '11', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('76', '38', '201430090127', '吴淑慧', '13', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('77', '39', '201430090128', '饶亚倩', '15', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('78', '40', '201430090130', '谭月嫦', '17', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('79', '41', '201430090132', '温小仪', '19', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('80', '42', '201430090135', '张康玉', '21', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('81', '43', '201430090142', '马钟涛', '23', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('82', '44', '201430090145', '肖颖', '25', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('83', '45', '201430090173', '关晓琳', '27', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('84', '46', '201430090025', '罗帼英', '29', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('85', '47', '201430090012', '张炜能', '31', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('86', '48', '201430090010', '杨嘉欣', '33', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('87', '49', '201430090021', '张文燕', '35', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('88', '1', '201430090195', '张秋杏', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('89', '2', '201430090223', '何宇静', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('90', '3', '201430090219', '吴柏棋', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('91', '4', '201430090216', '李斯琪', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('92', '5', '201430090211', '何嘉丽', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('93', '6', '201430090224', '蔡子荣', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('94', '7', '201430090187', '蔡莹莹', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('95', '8', '201430090182', '梁伟俭', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('96', '9', '201430090177', '刘紫珊', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('97', '10', '201430090174', '陈铭惠', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('98', '11', '201430090168', '周韵茜', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('99', '12', '201430090163', '张文俊', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('100', '13', '201430090272', '林广泉', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('101', '14', '201430090319', '潘爱真', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('102', '15', '201430090307', '陈海龙', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('103', '16', '201430090305', '吴伟华', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('104', '17', '201430090285', '陈晓洁', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('105', '18', '201430090229', '吕淑文', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('106', '19', '201430090269', '张宪浩', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('107', '20', '201430090264', '洪树鑫', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('108', '21', '201430090263', '杨钰莹', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('109', '22', '201430090240', '罗小玲', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('110', '23', '201430090237', '陈思宇', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('111', '24', '201430090320', '刘雯琪', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('112', '25', '201430090032', '金碧炫', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('113', '26', '201430090054', '黄秋敏', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('114', '27', '201430090042', '何景豪', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('115', '28', '201430090035', '谢冠豪', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('116', '29', '201430090034', '钟伟樑', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('117', '30', '201430090061', '钟俭成', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('118', '31', '201430090026', '莫小莹', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('119', '32', '201430090024', '刘炳晖', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('120', '33', '201430090022', '施建威', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('121', '34', '201430090004', '李子聪', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('122', '35', '201330114262', '叶芾林', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('123', '36', '201430090148', '颜晓苗', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('124', '37', '201430090124', '巫建松', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('125', '38', '201430090143', '黄少鹏', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('126', '39', '201430090134', '刘俊斌', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('127', '40', '201430090131', '文安琪', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('128', '41', '201430090126', '曾伶俐', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('129', '42', '201430090071', '余集堡', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('130', '43', '201430090116', '宋芷晴', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('131', '44', '201430090114', '朱巾娥', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('132', '45', '201430090105', '朱雯静', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('133', '46', '201430090087', '梁毅俊', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');
INSERT INTO `allworks` VALUES ('134', '47', '201430090076', '钟苏婷', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1', '-1');

-- ----------------------------
-- Records for `classss`
-- ----------------------------
INSERT INTO `classss` VALUES ('1', '工商学院14级工商管理（1）班', '38');
INSERT INTO `classss` VALUES ('2', '工商学院14级工商管理（2）班', '49');
INSERT INTO `classss` VALUES ('3', '工商学院14级工商管理（3）班', '47');

-- ----------------------------
-- Records for `singlegrade`
-- ----------------------------
INSERT INTO `singlegrade` VALUES ('1', '1', '201330092001', '45', '70', '115', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('2', '2', '201330092015', '46', '71', '117', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('3', '3', '201330092018', '47', '72', '119', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('4', '4', '201330092020', '48', '73', '121', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('5', '5', '201330092025', '49', '74', '123', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('6', '6', '201330092027', '50', '75', '125', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('7', '7', '201330092034', '51', '76', '127', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('8', '8', '201330092039', '52', '77', '129', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('9', '9', '201330092043', '53', '78', '131', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('10', '10', '201330092053', '54', '79', '133', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('11', '11', '201330092054', '55', '80', '135', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('12', '12', '201330092058', '56', '81', '137', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('13', '13', '201330092061', '57', '82', '139', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('14', '14', '201330092065', '58', '83', '141', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('15', '15', '201330092073', '59', '84', '143', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('16', '16', '201330092078', '60', '33', '93', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('17', '17', '201330092080', '61', '34', '95', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('18', '18', '201330092084', '62', '35', '97', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('19', '19', '201330092097', '63', '36', '99', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('20', '20', '201330092098', '64', '37', '101', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('21', '21', '201330092100', '65', '38', '103', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('22', '22', '201330092106', '66', '39', '105', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('23', '23', '201330092109', '67', '40', '107', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('24', '24', '201330092110', '68', '41', '109', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('25', '25', '201330092113', '69', '42', '111', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('26', '26', '201330092114', '70', '43', '113', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('27', '27', '201330092118', '71', '44', '115', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('28', '28', '201330092130', '72', '45', '117', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('29', '29', '201330092135', '73', '46', '119', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('30', '30', '201330092136', '74', '47', '121', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('31', '31', '201330092137', '75', '48', '123', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('32', '32', '201330092138', '76', '49', '125', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('33', '33', '201330092145', '23', '43', '66', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('34', '34', '201330092147', '24', '44', '68', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('35', '35', '201330092159', '25', '45', '70', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('36', '36', '201330092162', '26', '46', '72', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('37', '37', '201330092163', '27', '47', '74', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('38', '38', '201330092173', '28', '48', '76', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('88', '1', '201430090248', '51', '1', '52', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('89', '2', '201430090236', '52', '2', '54', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('90', '3', '201430090234', '53', '3', '56', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('91', '4', '201430090253', '54', '4', '58', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('92', '5', '201430090256', '55', '5', '60', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('93', '6', '201430090257', '56', '6', '62', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('94', '7', '201430090215', '57', '7', '64', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('95', '8', '201430090209', '58', '8', '66', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('96', '9', '201430090193', '59', '9', '68', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('97', '10', '201430090183', '60', '10', '70', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('98', '11', '201430090179', '61', '11', '72', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('99', '12', '201430090322', '62', '12', '74', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('100', '13', '201430105049', '63', '13', '76', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('101', '14', '201430093096', '64', '14', '78', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('102', '15', '201430093082', '65', '15', '80', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('103', '16', '201430093068', '66', '1', '67', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('104', '17', '201430090296', '67', '2', '69', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('105', '18', '201430090321', '68', '3', '71', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('106', '19', '201430090318', '69', '4', '73', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('107', '20', '201430090306', '70', '5', '75', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('108', '21', '201430090299', '71', '6', '77', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('109', '22', '201430090298', '72', '7', '79', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('110', '23', '201430090141', '73', '8', '81', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('111', '24', '201430090075', '74', '9', '83', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('112', '25', '201430090101', '75', '10', '85', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('113', '26', '201430090100', '76', '11', '87', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('114', '27', '201430090097', '77', '12', '89', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('115', '28', '201430090091', '78', '13', '91', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('116', '29', '201430090112', '79', '14', '93', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('117', '30', '201430090073', '80', '15', '95', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('118', '31', '201430090064', '81', '16', '97', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('119', '32', '201430090058', '82', '17', '99', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('120', '33', '201430090051', '2', '1', '3', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('121', '34', '201430090043', '3', '2', '5', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('122', '35', '201430090175', '4', '3', '7', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('123', '36', '201430090113', '5', '4', '9', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('124', '37', '201430090119', '6', '5', '11', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('125', '38', '201430090127', '7', '6', '13', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('126', '39', '201430090128', '8', '7', '15', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('127', '40', '201430090130', '9', '8', '17', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('128', '41', '201430090132', '10', '9', '19', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('129', '42', '201430090135', '11', '10', '21', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('130', '43', '201430090142', '12', '11', '23', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('131', '44', '201430090145', '13', '12', '25', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('132', '45', '201430090173', '14', '13', '27', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('133', '46', '201430090025', '15', '14', '29', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('134', '47', '201430090012', '16', '15', '31', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('135', '48', '201430090010', '17', '16', '33', 'Qian_gong');
INSERT INTO `singlegrade` VALUES ('136', '49', '201430090021', '18', '17', '35', 'Qian_gong');

-- ----------------------------
-- Records for `totalmark`
-- ----------------------------
INSERT INTO `totalmark` VALUES ('1', '1', '201330092001', '陈秋华', '115', '73', '8', '0');
INSERT INTO `totalmark` VALUES ('2', '2', '201330092015', '郝顺章', '117', '65', '85', '1');
INSERT INTO `totalmark` VALUES ('3', '3', '201330092018', '陈子琦', '119', '54', '85', '103');
INSERT INTO `totalmark` VALUES ('4', '4', '201330092020', '黄思准', '121', '86', '80', '110');
INSERT INTO `totalmark` VALUES ('5', '5', '201330092025', '陈旭鸿', '123', '69', '90', '109');
INSERT INTO `totalmark` VALUES ('6', '6', '201330092027', '陈成钧', '125', '78', '80', '111');
INSERT INTO `totalmark` VALUES ('7', '7', '201330092034', '林仁仕', '127', '72', '80', '111');
INSERT INTO `totalmark` VALUES ('8', '8', '201330092039', '陈平深', '129', '80', '75', '114');
INSERT INTO `totalmark` VALUES ('9', '9', '201330092043', '陈超鹏', '131', '81', '75', '115');
INSERT INTO `totalmark` VALUES ('10', '10', '201330092053', '欧艳芬', '133', '62', '85', '114');
INSERT INTO `totalmark` VALUES ('11', '11', '201330092054', '江家尧', '135', '75', '70', '116');
INSERT INTO `totalmark` VALUES ('12', '12', '201330092058', '余麟浩', '137', '84', '85', '121');
INSERT INTO `totalmark` VALUES ('13', '13', '201330092061', '林志鑫', '139', '78', '70', '120');
INSERT INTO `totalmark` VALUES ('14', '14', '201330092065', '何志伟', '141', '68', '65', '119');
INSERT INTO `totalmark` VALUES ('15', '15', '201330092073', '刘荣乐', '143', '74', '90', '124');
INSERT INTO `totalmark` VALUES ('16', '16', '201330092078', '郑文鑫', '93', '76', '60', '86');
INSERT INTO `totalmark` VALUES ('17', '17', '201330092080', '吴靖康', '95', '60', '60', '84');
INSERT INTO `totalmark` VALUES ('18', '18', '201330092084', '陈宝怡', '97', '85', '90', '94');
INSERT INTO `totalmark` VALUES ('19', '19', '201330092097', '胡伊敏', '99', '82', '85', '94');
INSERT INTO `totalmark` VALUES ('20', '20', '201330092098', '柯坚宇', '101', '76', '80', '94');
INSERT INTO `totalmark` VALUES ('21', '21', '201330092100', '林秀媛', '103', '55', '95', '93');
INSERT INTO `totalmark` VALUES ('22', '22', '201330092106', '何韵仪', '105', '84', '90', '99');
INSERT INTO `totalmark` VALUES ('23', '23', '201330092109', '赵彩虹', '107', '77', '95', '100');
INSERT INTO `totalmark` VALUES ('24', '24', '201330092110', '李惠玉', '109', '76', '60', '98');
INSERT INTO `totalmark` VALUES ('25', '25', '201330092113', '庞延玲', '111', '65', '85', '99');
INSERT INTO `totalmark` VALUES ('26', '26', '201330092114', '肖海媚', '113', '69', '80', '101');
INSERT INTO `totalmark` VALUES ('27', '27', '201330092118', '吴彩玲', '115', '68', '85', '103');
INSERT INTO `totalmark` VALUES ('28', '28', '201330092130', '陈志明', '117', '49', '98', '102');
INSERT INTO `totalmark` VALUES ('29', '29', '201330092135', '陈柏蓉', '119', '54', '40', '98');
INSERT INTO `totalmark` VALUES ('30', '30', '201330092136', '黄楚彬', '121', '67', '60', '104');
INSERT INTO `totalmark` VALUES ('31', '31', '201330092137', '彭金灿', '123', '69', '80', '108');
INSERT INTO `totalmark` VALUES ('32', '32', '201330092138', '林嘉怡', '125', '77', '80', '111');
INSERT INTO `totalmark` VALUES ('33', '33', '201330092145', '林东升', '66', '64', '70', '66');
INSERT INTO `totalmark` VALUES ('34', '34', '201330092147', '吴逸舒', '68', '70', '85', '70');
INSERT INTO `totalmark` VALUES ('35', '35', '201330092159', '张翎', '70', '68', '80', '71');
INSERT INTO `totalmark` VALUES ('36', '36', '201330092162', '雷俊贤', '72', '64', '65', '70');
INSERT INTO `totalmark` VALUES ('37', '37', '201330092163', '汤诗文', '74', '67', '85', '74');
INSERT INTO `totalmark` VALUES ('38', '38', '201330092173', '黄俊', '76', '61', '65', '72');
INSERT INTO `totalmark` VALUES ('39', '1', '201430090248', '苏英诗', '52', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('40', '2', '201430090236', '钟胜', '54', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('41', '3', '201430090234', '何昌原', '56', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('42', '4', '201430090253', '程裕', '58', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('43', '5', '201430090256', '冯嘉欣', '60', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('44', '6', '201430090257', '张智律', '62', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('45', '7', '201430090215', '何佩怡', '64', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('46', '8', '201430090209', '赵爱醒', '66', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('47', '9', '201430090193', '陈丽军', '68', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('48', '10', '201430090183', '陈春玉', '70', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('49', '11', '201430090179', '廖若红', '72', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('50', '12', '201430090322', '李东铭', '74', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('51', '13', '201430105049', '叶立中', '76', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('52', '14', '201430093096', '彭鸿标', '78', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('53', '15', '201430093082', '李启东', '80', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('54', '16', '201430093068', '朱孝文', '67', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('55', '17', '201430090296', '米纪刚', '69', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('56', '18', '201430090321', '江其航', '71', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('57', '19', '201430090318', '汪驰', '73', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('58', '20', '201430090306', '庄石园', '75', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('59', '21', '201430090299', '周颖', '77', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('60', '22', '201430090298', '符天玉', '79', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('61', '23', '201430090141', '姚子轩', '81', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('62', '24', '201430090075', '叶建达', '83', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('63', '25', '201430090101', '余贵玲', '85', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('64', '26', '201430090100', '何敏', '87', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('65', '27', '201430090097', '吴祺威', '89', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('66', '28', '201430090091', '袁旭嘉', '91', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('67', '29', '201430090112', '黄婧雯', '93', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('68', '30', '201430090073', '李文东', '95', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('69', '31', '201430090064', '陈勇', '97', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('70', '32', '201430090058', '曹林青', '99', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('71', '33', '201430090051', '钟超飞', '3', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('72', '34', '201430090043', '刘赵红', '5', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('73', '35', '201430090175', '胡婉仪', '7', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('74', '36', '201430090113', '江静文', '9', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('75', '37', '201430090119', '何福针', '11', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('76', '38', '201430090127', '吴淑慧', '13', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('77', '39', '201430090128', '饶亚倩', '15', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('78', '40', '201430090130', '谭月嫦', '17', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('79', '41', '201430090132', '温小仪', '19', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('80', '42', '201430090135', '张康玉', '21', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('81', '43', '201430090142', '马钟涛', '23', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('82', '44', '201430090145', '肖颖', '25', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('83', '45', '201430090173', '关晓琳', '27', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('84', '46', '201430090025', '罗帼英', '29', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('85', '47', '201430090012', '张炜能', '31', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('86', '48', '201430090010', '杨嘉欣', '33', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('87', '49', '201430090021', '张文燕', '35', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('88', '1', '201430090195', '张秋杏', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('89', '2', '201430090223', '何宇静', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('90', '3', '201430090219', '吴柏棋', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('91', '4', '201430090216', '李斯琪', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('92', '5', '201430090211', '何嘉丽', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('93', '6', '201430090224', '蔡子荣', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('94', '7', '201430090187', '蔡莹莹', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('95', '8', '201430090182', '梁伟俭', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('96', '9', '201430090177', '刘紫珊', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('97', '10', '201430090174', '陈铭惠', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('98', '11', '201430090168', '周韵茜', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('99', '12', '201430090163', '张文俊', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('100', '13', '201430090272', '林广泉', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('101', '14', '201430090319', '潘爱真', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('102', '15', '201430090307', '陈海龙', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('103', '16', '201430090305', '吴伟华', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('104', '17', '201430090285', '陈晓洁', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('105', '18', '201430090229', '吕淑文', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('106', '19', '201430090269', '张宪浩', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('107', '20', '201430090264', '洪树鑫', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('108', '21', '201430090263', '杨钰莹', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('109', '22', '201430090240', '罗小玲', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('110', '23', '201430090237', '陈思宇', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('111', '24', '201430090320', '刘雯琪', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('112', '25', '201430090032', '金碧炫', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('113', '26', '201430090054', '黄秋敏', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('114', '27', '201430090042', '何景豪', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('115', '28', '201430090035', '谢冠豪', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('116', '29', '201430090034', '钟伟樑', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('117', '30', '201430090061', '钟俭成', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('118', '31', '201430090026', '莫小莹', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('119', '32', '201430090024', '刘炳晖', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('120', '33', '201430090022', '施建威', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('121', '34', '201430090004', '李子聪', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('122', '35', '201330114262', '叶芾林', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('123', '36', '201430090148', '颜晓苗', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('124', '37', '201430090124', '巫建松', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('125', '38', '201430090143', '黄少鹏', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('126', '39', '201430090134', '刘俊斌', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('127', '40', '201430090131', '文安琪', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('128', '41', '201430090126', '曾伶俐', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('129', '42', '201430090071', '余集堡', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('130', '43', '201430090116', '宋芷晴', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('131', '44', '201430090114', '朱巾娥', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('132', '45', '201430090105', '朱雯静', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('133', '46', '201430090087', '梁毅俊', '0', '0', '0', '0');
INSERT INTO `totalmark` VALUES ('134', '47', '201430090076', '钟苏婷', '0', '0', '0', '0');

